--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀     ChannelDev       (@Ch_dev)       ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀          reply  :   الردود              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function run(msg, matches)
return [[

👾-ساقط : اسم البوت
👾 -احبك
👾 -تحبني
👾 -اكرهك
👾-منو حبيبي
👾 -منو اني
👾 -وينك
👾 -غنيلي
👾 -غني
👾 -غنيي
👾 -مطور : اذا تريد بوت يطلعلك معرفي
👾 -حبيبتي
👾 -شباب
👾 -شلونك
👾 -تعال/ي خاص
👾 -منو حبيبي
👾 -بوسني
 يے  🔹
  :للتواصل مع المطور
__________________
🔸➖🔹➖🔸➖🔹➖
💯-Đєⱴ💀: @ii02ii
💯-Đєⱴ ฿๏ͳ💀: @ii02ii_bot
💯-Đєⱴ Ϲḫ₳ͷͷєℓ💀: @ch_dev
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(ردود البوت)$",
},
run = run 
}
end
