--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀     ChannelDev       (@Ch_dev)       ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀          dev  :   المطور               ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]do

function run(msg, matches)
return [[

االبوت الذي يعمل على مجوعات السوبر 🔸

يعمل البوت على مجموعات سوبر تصل الى5k عضو 🔷

     ≪تم صنع البوت بواسطة المطور≫
     
     
                      『 @ii02ii 』
                      
                      ≪بوت التواصل للمحضورين :-*≫
   
                                          『 @ii02ii_bot 』

                                            ≪قناتي وخاصه للشروحات ⛔️😴✋🏿 ≫

                                                                『 @Ch_Dev 』

            🔹#Dev     #مہٰيہٰمہٰو مہٰشہٰآكہٰل آلہٰعہٰرآقہٰيے  🔹
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"المطور$",

},
run = run 
}
end
-- By Dev Memo (@ii02ii)