--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀          HELP2  : 2مساعدة              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function Memo(msg, matches)
return "گبدِ عٍمرٍيَ 💋😻 : @"..msg.from.username.."\n\n"
.."ٳﯝٳمـْر ٳلہمـْسہحہ ﯝٳلہﯝضعـ فُہيہ ٳلہكُہرﯝٻً 🌚🖖🏼:"..msg.to.title.."\"..".."\n\n" 
.."ٳلہمـْسہحہ 💊".."\n"
.."💊 امسح + عدد : لہمـْسہحہ ٳلہرسہٳئلہ ُہيہ ٳلہمـْجہمـْﯝعـه 🚀".."\n"
.."💊 امسح  الادمنيه :لہمـْسہحہ جہمـْيہعـ ٳلہٳدٍمـْنٍيہه 👏🏻".."\n"
.."💊 امسح الوصف : لہمـْسہحہ ٳلہحہﯝلہ 😐🖖🏼".."\n"
.."💊 امسح القوانين : لہمـْسہحہ قـًﯝنٍيہنٍ ٳلہٻًﯝتہ 📲".."\n"
.."💊 امسح : لہمـْسہحہ ٳلہكُہلہمـْه ٻًٳلہردٍ 💋😻".."\n"
.."💊 امسح المعرف :  لہمـْسہحہ مـْعـرفُہ ٳلہمـْجہمـْﯝعـه ".."\n"
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."ٳلہﯝضع 👍🏻😽".."\n"
.."📌ضع اسم : لہﯝضعـ ٳسہمـْ لہلہمـْجہمـْﯝعـه 👍🏻😽".."\n"
.."📌ضع قوانين : لہﯝضعـ قـًﯝٳنٍيہنٍ ٳلہمـْجہمـْﯝعـه 👍🏻😽".."\n"
.."📌ضع تكرار : لہﯝضعـ حہدٍ ٳلہتہكُہرٳر مـْنٍ 5ً لہلہ8ً0ً 👍🏻😽 ".."\n"
.."📌ضع وصف : لہﯝضعـ ٳلہحہﯝلہ گبدِ حہيہٳتہيہ💋😻".."\n"
.."📌ضع صوره : لہﯝضعـ صًﯝره فُہيہ ٳلہمـْجہمـْﯝعـه 👍🏻😽".."\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🕵 المطور الاساسي : @ii02ii 💋😻".."\n"
.."🕵المطورين 💋😻 : @ss02ss و @x_x_5 و @mm01mm".."\n"
.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"
end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م2"
  }, 
  run = Memo 
}

end

