--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀          HELP2  : 2مساعدة              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function Memo(msg, matches)
return "حہٰب  عہٰمہٰريے 💋😻 : @"..msg.from.username.."\n\n"
.."آوامہٰر الہٰمہٰسہٰح وآلہٰوضہٰع فہٰيے كہٰروبہٰ 🌚🖖🏼:"..msg.to.title.."\"..".."\n\n" 
.."آلہٰمہٰسہٰح  💊".."\n"
.."💊 امسح + عدد : لہٰمہٰسہٰح آلہٰرسہٰآئہٰل فہٰيےآلكہٰروبہٰ 🚀".."\n"
.."💊 امسح  الادمنيه :لہمـْسہحہ جہمـْيہعـ ٳلہٳدٍمـْنٍيہه 👏🏻".."\n"
.."💊 امسح الوصف : لہٰمہٰسہٰح آلآدمہٰنہٰيہٰة 😐🖖🏼".."\n"
.."💊 امسح القوانين : لہٰمہٰسہٰح قہٰوآنہٰين آلكہٰروبہٰ  📲".."\n"
.."💊 امسح : لہٰمہٰسہٰح آلہٰكہٰلہٰمہٰة بہٰآلہٰرد 💋😻".."\n"
.."💊 امسح المعرف :  لہٰمہٰسہٰح  مہٰعہٰرفہٰ آلہٰمہٰجہٰمہٰوعہٰة 🎸🙀 ".."\n"
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."آلہٰوضہٰع📌".."\n"
.."📌ضع اسم : لہٰوضہٰع آسہم  للہٰمہٰجہٰمہٰوعہٰة👍🏻😽".."\n"
.."📌ضع قوانين : لہٰوضہٰع قہٰوآنہٰيہٰن للہٰمہٰجہٰمہٰوعہٰة 👍🏻😽".."\n"
.."📌ضع تكرار : لہٰوضہٰع تہٰكہٰرار مہٰن 5ًلہٰلـ8ً0ً 👍🏻😽 ".."\n"
.."📌ضع وصف : لہٰوضہٰع آلہٰوصہٰف كہٰبہٰد حہيہٳتہيہ💋😻".."\n"
.."📌ضع صوره : لہٰوضہٰع  صہٰورة فُہيہ آلہٰمہٰجہٰمہٰوعہٰة 👍🏻😽".."\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🕵✋🏻 المطورين 💋🙀👇🏻 ".."\n"
.."@II02II 🏌".."\n"
.."@mm01mm 🏓".."\n"
.."@ss02ss 🏌 ".."\n"

.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"

end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م2"
  }, 
  run = Memo 
}

end

