--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        orders :  اوامر البوت             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function MemoMushakil(msg, matches)
return " كُہفُہشہه حہيہٳتہيہ 💋😻 : @"..msg.from.username.."\n\n"
.."ٳﯝٳمـْر ٳلہرفُہع ﯝ ٳلہكُہتہمـْ فُہيہ ٳلہكُہرﯝٻً 🙂💔:"..msg.to.title.."\"..".."\n\n" 
.."ٳلہرفُہع 🍷 * يہعـمـْلہ ٻًٳلہردٍ ٳﯝ ٳلہمـْعـرفُہ 😒🖖🏼".."\n"
.."🍷ارفع ادمن : لہرفُہعـ ٳدٍمـْنٍ فُہيہ ٳلہٻًﯝتہ 🙂💔".."\n"
.."🍷نزل ادمن  :  لہتہنٍڒٍيہلہ ٳلہٳدٍمـْنٍ 😭😂 ".."\n"
.."🍷ارفع اداري : لہرفُہعـ ٳلہشہخہصً ٳدٍمـْنٍ فُہيہ  ٳلہكُہرﯝٻً 👮🏻 ".."\n"
.."🍷نزل اداري : لہتہنٍڒٍيہلہ ٳلہٳدٍمـْنٍ ٳلہى عـضﯝ 😭😂".."\n"
.."🍷الاداريين : لہمـْعـرفُہه ٳلہٳدٍمـْنٍيہه فُہيہ ٳلہكُہرﯝٻً 👍🏻😽".."\n"
.."🍷الادمنيه : لہضهﯝر ٳلہٳدٍمـْنٍيہه فُہيہ آلہبہوتہ 👍🏻😽 ".."\n"

.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."آلُڪتْمْ وُآلُحظًر 🤖".."\n"
.."يہعـمـْلہ ٻًٳلہردٍ ٳﯝ ٳلہمـْعـرفُہ 😐🖖🏼".."\n"
.."🤖حظر + المعرف : لہحہظًر ٳلہعـضﯝ مـْنٍ ٳلہمـْجہمـْﯝعـه 😾😻".."\n"
.."🤖الغاء الحظر : لہٳلہغہٳء ٳلہحہظًر عـنٍ ٳلہشہخہصً 🙂💔".."\n"
.."🤖اكتم : لہكُہتہمـْ ٳلہعـضﯝ بالرد 👍🏻😽".."\n"
.."🤖اكتم : لہٳلہغہٳء ٳلہكُہتہمـْ بالرد 💋😻".."\n"
.."🤖المكتومين: لہمـْشہٳهدٍة مـْنٍ تہمـْ كُہتہمـْه 💋😻".."\n"
.."🤖بلوك : لہطہردٍ ٳلہعـضﯝ مـْنٍ ٳلہمـْجہمـْﯝعـه بالرد 💋😻".."\n"
.."🤖حظر عام : لہحہظًر ٳلہعـضﯝ مـْنٍ 6ًً7ًَ كُہرﯝٻً 😂🖖🏼".."\n"
.."🤖الغاء العام : لہرفُہعـ ٳلہٻًٳنٍدٍ ٳلہعـٳمـْ 😕🖖🏼".."\n"
.."🤖قائمه العام : لہمـْشہٳهدٍة مـْنٍ تہمـْحہظًره عـٳمـْ 💋😻".."\n"
.."🤖منع + كلمه : لہمـْنٍعـ كُہلہمـْه فُہيہ ٳلہمـْجہمـْﯝعـه 👍🏻😽".."\n"
.."🤖الغاء منع + الكلمه : لہلہسہمـْٳحہ ٻًكُہتہٳٻًه ٳلہكُہلہمـْه فُہيہ ٳلہمـْجہمـْﯝعـه 💋😻".."\n"
.."🤖قائمه المنع : لہرؤيہه ٳلہكُہلہمـْٳتہ ٳلہمـْحہظًﯝرة 🕵".."\n"
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🕵 المطور الاساسي : @ii02ii 💋😻".."\n"
.."🕵المطورين 💋😻 : @ss02ss و @x_x_5 و @mm01mm".."\n"
.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"
end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م3"
  }, 
  run = MemoMushakil,
}

end
