--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        orders :  اوامر البوت             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function MemoMushakil(msg, matches)
return " كہٰفہٰشہٰة شہٰعہٰريے 💋😻 : @"..msg.from.username.."\n\n"
.." آوامہٰر آلہٰرفہٰع + آلہٰكہٰتم  فہٰيے كہٰروبہٰ 🙂🍷:"..msg.to.title.."\"..".."\n\n" 
.."آلہٰرفہٰع🍷 * يہٰعہٰمہٰل بہٰألہٰرد + آلہٰمہٰعہٰرفہٰ  😒🖖🏼".."\n"
.."🍷ارفع ادمن : لہٰرفہٰع آدمہٰن فُہيہ آلہٰبہٰوتہٰ 🙂💔".."\n"
.."🍷نزل ادمن  :  لہٰتہٰنہٰزيہٰل آلآدمہٰن 😭😂 ".."\n"
.."🍷ارفع اداري : لہٰرفہٰع آلہٰعہٰضو آدمہٰن فہٰيے الكہٰروبہٰ 👮🏻 ".."\n"
.."🍷نزل اداري : لہٰتہٰنہٰزيہٰل آلآدمہٰن آلہٰى عہٰضو 😭😂".."\n"
.."🍷الاداريين : لہٰمہٰشآهہٰدة آدمہٰنہٰيہٰة الہٰكہٰروبہٰ👍🏻😽".."\n"
.."🍷الادمنيه : لہٰمہٰشآهہٰدة آدمہٰنہٰيہٰة آلہٰبہٰوتہٰ  👍🏻😽 ".."\n"

.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."آلہٰكہٰتہٰم 👾 + آلہٰحہٰظہٰر 🤖".."\n"
.." يہٰعہٰمہٰل بہٰألہٰرد + آلہٰمہٰعہٰرفہٰ   😐🖖🏼".."\n"
.."🤖حظر + المعرف : لہٰحہٰظہٰر آلہٰعہٰضہٰو مہٰن آلہٰكہٰروبہٰ 😾😻".."\n"
.."🤖الغاء الحظر : لآلہٰغہٰاء آلہٰحہٰظہٰر مہٰن آلہٰعہٰضو 🙂💔".."\n"
.."👾اكتم : لہكُہتہمـْ ٳلہعـضﯝ بالرد 👍🏻😽".."\n"
.."👾اكتم : لہٳلہغہٳء ٳلہكُہتہمـْ بالرد 💋😻".."\n"
.."👾⁉️المكتومين:  لہٰمہٰشآهہٰدة مہٰن تہم كہتہمہة  🙁🍷".."\n"
.."🏌بلوك : لہٰدفہٰر آلہٰعہٰضہٰو مہٰن آلہٰكہٰروبہٰ  👦🏻🏌".."\n"
.."💉منع + كلمه : لہٰمہٰنہٰع كہٰلہٰمہٰة مہٰن آلہٰكہٰروبہٰ 👍🏻😽".."\n"
.."💉✋🏻الغاء منع + الكلمه : لہٳلہغہٳء آلہكہلمہة الہممنہوعہة 😱🍷".."\n"
.."💉⁉️ قائمه المنع : لہٰمہٰشآهہٰدة آلہٰكہٰلہٰمہٰآت ألہٰممنہٰوعہٰة 🕵".."\n"
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🕵✋🏻 المطورين 💋🙀👇🏻 ".."\n"
.."@II02II 🏌".."\n"
.."@mm01mm 🏓".."\n"
.."@ss02ss 🏌 ".."\n"

.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"

end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م3"
  }, 
  run = MemoMushakil,
}

end
