--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        Help 4 :  مساعدة 4              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function Memo(msg, matches)
return "ٳهلہٳ ٻًكُہ يہٳ عـضﯝ 💋😹 : @"..msg.from.username.."\n\n"
.."آلُآۆآمرٍ آلُيَ تشُملُگ  لُترٍۆحٍ لُغيَرٍہآ لُگ بگرٍۆب 😐🖖🏼 "..msg.to.title.."\"..".."\n\n"
.."الطقس + اسم المدينه  : لُمعٍرٍفَہ آلُطُقس آلُحٍآلُيَ ☔️ ".."\n"
.."الاذان + اسم المدينه : لُمعٍرٍفَہ آۆقآت آلُصلُآة  آلُخـآصہ بگم 💋😻".."\n"
.."دعم + كلمه : لُآرٍسآلُ رٍسآلُتگ عٍ مجٍمۆعٍہ آلُخـآصہ ببۆت سآقطُ 🤖".."\n"
.."زخرف + اسم انكليزي : لُزخـرٍفَہ آلُگلُآم آلُآنگلُيَزيَ👍🏻😽".."\n"
.."زخرف + اسم عربي : لُزخـرٍفَہ آلُگلُآم آلُعٍرٍبيَ 👍🏻😻".."\n"
.."خريطه + اسم المنطقه : لُمشُآہدِة خـآرٍطُہ بلُآدِگ آۆ محٍآفَظًتگ 🤖  ".."\n"
.."اسمي :  لُمشُآہدِة آسمگ آلُمحٍلُۆ 😂🖖🏼".."\n"
.."اسم الكروب : لُرٍؤيَہ آسم آلُگرٍۆب 📲😈".."\n"
.."مطور البوت :  لُمعٍرٍفَہ آلُمطُۆرٍ آلُآسآسيَ 🕵💋😻".."\n"
.."اريد بوت : لُطُلُب آلُبۆت فَيَ گرٍۆبگ ۆيَجٍب آن يَگۆن آگثرٍ شُخـص 😐🖖🏼".."\n"

.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."➖🔹➖🔸➖🔹➖".."\n"
.."🕵 المطور الاساسي : @ii02ii 💋😻".."\n"
.."🕵المطورين 💋😻 : @ss02ss و @x_x_5 و @mm01mm".."\n"
.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"
.."]]".."\n"

end

return {
  description = "Shows bot help", 
 -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م4"
  }, 
  run = Memo,
}

end