--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        Help 5 :   5 مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function Memo(msg, matches)
if is_sudo(msg) and matches[1]== "م5" then
return "آهہٰلآ بہٰكہٰ بہٰطہٰوريے💋🤖 : @"..msg.from.username.."\n\n"
.."آلآوآمہٰر آلہٰمتہٰآحہٰة لہٰتہٰآج مہٰخہٰيے آلبہٰطہٰور 😽🙊 @"..msg.from.username.."\n\n"
.."🤖 ترقيه  : لہٰتہٰحہٰويہٰل آلہٰمہٰجہٰموعہٰة سہٰوبہٰر 🚀 ".."\n"
.."🕵 فعل :  لہٰتفہٰعہٰيہٰل آلہٰبوتہٰ  فہٰيے الكہٰروبہٰ👍🏻🌚".."\n"
.."🕵 عطل : لہٰتعہٰطيہٰل آلہٰبوتہٰ  فہٰيے الكہٰروبہٰ 👍🏻😈 ".."\n"
.."🕵 ارفع المدير : لہٰرفہٰع آلہٰمہٰديہٰر فہٰيے الكہٰروبہٰ  👍🏻😽".."\n"
.."🕵 اطفاء البوت : لآطہٰفآء آلہبہٰوتہٰ فہٰيے كہٰروبہٰ مہٰعيہٰن👍🏻😒".."\n"
.."🕵 تشغيل البوت : لہٰتہٰشغيہٰل آلہبہٰوتہٰ فہٰيے كہٰروبہٰ 👍🏻😻  ".."\n"
.."🕵 طرد البوت : لہٰطہٰرد آلہٰبہٰوت مہٰن الكہٰروبہٰ😐🖖🏼".."\n"
.."🕵 اذاعه + الكلام : لہٰنشہٰر فيے جہٰمہٰيہٰع الكہٰروبہٰات 💻".."\n"
.."🤖جلب ملف + اسمه : لہٰجہٰلہٰب مہٰلفہٰ مہٰن آلہٰسہٰيرفہٰر 👍🏻🌚".."\n"
.."🤖 تنشيط السيرفر : لہٰتہٰنہشہٰيط آلہٰبوتہٰ  💋😻".."\n"
.."🕵 ضيف البوت + الرابط  : لآضہٰآفہٰة آلہٰبہٰوت عہٰن طہٰريق آلہٰرآبہٰط  👍🏻😻".."\n"
.."🤖 ⁉️حظر عام : لہٰحہٰظہٰر آلہٰعہٰضہٰو مہٰن كہٰروبہٰآت الہٰبہٰوت😂🖖🏼".."\n"
.."🎸🤖الغاء العام  : لآلہٰغہٰاء  آلہٰعہٰآم  عہٰن آلہٰشہٰخہٰص 🙁🍷".."\n"
.."🙀✋🏻قائمه العام   : لہٰمہٰشآهہٰدة آلہٰمہٰحہٰظہٰوريہٰن عہٰآم 🌚😹".."\n"
.."👾 رست :  لہٰتہٰرسہٰيہٰت آلہٰبہٰوت مہٰن الہٰسہٰيرفہٰر 🤖💻".."\n"
.."👾⁉️ ريديس :  لہٰتہٰعہٰديہٰل عہٰمہٰل آلہٰبہٰوت 💋🙂".."\n"
.."👾⁉️ حدث :  لہٰتہٰحہٰديہٰث آلہٰبہٰوت 🤖🍷".."\n"


.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."🔸➖🔹➖🔸➖🔹➖🔸".."\n"
.."🕵✋🏻 المطورين 💋🙀👇🏻 ".."\n"
.."@II02II 🏌".."\n"
.."@mm01mm 🏓".."\n"
.."@ss02ss 🏌 ".."\n"

.."🕵-بوت التواصل للمحضورين💀: @ii02ii_bot".."\n"
.."💻📲-قناة المطور وخاصه للشروحات💀: @ch_dev".."\n"

end

if not is_momod(msg) then
return " للمشرفين فقط يله دعبل 😎🖕🏿"
end

end
return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^م5"
  }, 
  run = Memo,
}

end
