--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        Help  :  الاوامر (مساعدة)      0   ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function Memo(msg, matches)
return "مہٰرحہٰبہٰآً بہٰكہٰ يہٰآ 💋😻 : @"..msg.from.username.."\n\n"
.."آوآمہٰر آلہٰمہٰسہٰآعہٰدة فہٰيے  بہٰوتہٰ √ ՏԹφԵ ՅԾԵ √ هہٰيے 👇🏻 ".."\n"

.."➖🔹➖🔸➖🔹➖".."\n"

.." 👥 م1: لہٰعہٰرض آوآمہٰر آلہٰحہٰمہٰآيہٰة 🔓🔐 ".."\n"
 .." (اقفل_افتح )📲 ".."\n"
.."❌ م2: لہٰعہٰرض آوامہٰر الہٰمہٰسہٰح وآلہٰوضہٰع ⛳️🏌".."\n"
.." (امسح_ضع) 🤖📌".."\n"
.."💂🏻  م3: آوآمہٰر مہٰديہٰر آلہٰمہٰجہٰمہٰوعہٰة 👲🏻 ".."\n"
 .."(ارفع _حظر_اكتم)💻  ".."\n"
.."🙇🏻 م4:  آوآمہٰر آلہٰعہٰضہٰو 💂🏻  ".."\n"
.." (خاصه الك حب 😂) 😐🖖🏼".."\n"
.."🕵 م5: آوأمہٰر آلہٰمہٰطہٰوريہٰن 💋😻🙊 ".."\n"

.."➖🔹➖🔸➖🔹➖".."\n"
.."الاصدار ⛳️🏌 : لہٰمہٰعہٰرفہٰة مہٰوقہٰع آلآصہٰدآر 💋🚶🏻 ".."\n"
.."".."\n"

.."✋🏻تہٰآبہٰع كہٰل جہٰديہٰد ع قہٰنہٰآة آلہٰسہٰورس 🎸🤖".."\n"
.."[ @Ch_Dev ]🤖🎸".."\n\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.." آلہٰمہٰطوريہٰن :- 🙇🏻🍷 ".."\n"
.."❣ #مہٰيہٰمہٰو مہٰشہٰآكہٰل آلہٰعہٰرآقہٰيے  🕵 : @ii02ii ".."\n"
.."🏌 دآيہٰح 🙀 آلہٰنسہٰخة ألآصہٰلہٰيہٰة 🌚😹 @ss70ss ".."\n"

.."🕵✋🏻 نہٰظہٰوريے آلہٰرآسہٰة 🕵 @MM01MM".."\n"

.."👾⁉️ بہٰوتہٰ تہٰوآصہٰل آلہٰمہٰطہٰوريہٰن ".."\n"
.."🏓 #DevsBot : @ii02ii_bot ".."\n"

end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^الاوامر"
  }, 
  run = Memo 
}

end
