--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Memo                           ▀▄ ▄▀ 
▀▄ ▄▀     BY Memo       (@ii02iI)          ▀▄ ▄▀ 
▀▄ ▄▀ Making the file by Memo              ▀▄ ▄▀   
▀▄ ▄▀        Help  :  الاوامر (مساعدة)      0   ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function Memo(msg, matches)
return "👋 اهلا بك يا : @"..msg.from.username.."\n\n"
.."أومر المساعدة الخاصة ببوت √ ՏԹφԵ ՅԾԵ √ هية ".."\n"
.."  😌 ٵ̷ ۆ̷ٵ̷ م̷ر̷   ب̷ۆ̷ت̷ س̷ٵ̷ ق̷ط̷ُ ٵ̷ ل̷ع̷ٍر̷ب̷ي̷ہ̷ ☠🚬 ".."\n"

.."➖🔹➖🔸➖🔹➖".."\n"
.." 👥 م1: لُعٍرٍض آۆآمرٍ آلُحٍمآيَہ (قفل_فتح )📲 ".."\n"
.."❌ م2: آۆآمرٍ آلُمسحٍ ۆآلُۆضعٍ (مسح_ضع) 🤖📌".."\n"
.."💂🏻  م3:  آۆآمرٍ  مدِيَرٍ آلُمجٍمۆعٍہ (رفع _حظر)💻  ".."\n"
.."🙇🏻 م4:  آۆآمرٍ آلُعٍضۆ (خاصه الك حب 😂) 😐🖖🏼".."\n"
.."🕵 م5: آۆآمرٍ آلُمطُۆرٍيَن 💋😻🙊 ".."\n"

.."➖🔹➖🔸➖🔹➖".."\n"
.."".."\n"
.."".."\n"

.."👇🏿تأبعـونأَ كل جَديد عل قنأةَ الكروب👇🏿".."\n"
.."[ @ch_dev ]👾".."\n\n"
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp)
.."👇🏿للأستفسار:- راسل المطور:- ☢⚜ ".."\n"
.."❣ #ميمو_مشاكل_العراقي : @ii02ii ".."\n"
.."🙁 واذا محضور تعال اهنا 👇🏻🤒🍃".."\n"
.."❣ #DevBot : @ii02ii_bot ".."\n"

end

return {
  description = "Shows bot help", 
  -- usage = /مساعدة: Shows bot help",
  patterns = {
    "^الاوامر"
  }, 
  run = Memo 
}

end
